<p><font size="6"><b>03 - Pandas: Indexing and selecting data</b></font></p>


> *DS Data manipulation, analysis and visualisation in Python*  
> *December, 2017*

> *© 2016, Joris Van den Bossche and Stijn Van Hoey  (<mailto:jorisvandenbossche@gmail.com>, <mailto:stijnvanhoey@gmail.com>). Licensed under [CC BY 4.0 Creative Commons](http://creativecommons.org/licenses/by/4.0/)*

---

In [1]:
import pandas as pd

In [2]:
# redefining the example objects

# series
population = pd.Series({'Germany': 81.3, 'Belgium': 11.3, 'France': 64.3, 
                        'United Kingdom': 64.9, 'Netherlands': 16.9})

# dataframe
data = {'country': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 41526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']}
countries = pd.DataFrame(data)
countries

     area    capital         country  population
0   30510   Brussels         Belgium        11.3
1  671308      Paris          France        64.3
2  357050     Berlin         Germany        81.3
3   41526  Amsterdam     Netherlands        16.9
4  244820     London  United Kingdom        64.9

Setting the index to the country names:

In [3]:
countries = countries.set_index('country')
countries

                  area    capital  population
country
Belgium          30510   Brussels        11.3
France          671308      Paris        64.3
Germany         357050     Berlin        81.3
Netherlands      41526  Amsterdam        16.9
United Kingdom  244820     London        64.9

# Selecting data

<div class="alert alert-warning" style="font-size:120%">
<b>ATTENTION!</b>: <br><br>

One of pandas' basic features is the labeling of rows and columns, but this makes indexing also a bit more complex compared to numpy. <br><br> We now have to distuinguish between:

 <ul>
  <li>selection by **label** (using the row and column names)</li>
  <li>selection by **position** (using integers)</li>
</ul>
</div>

## `data[]` provides some convenience shortcuts

For a DataFrame, basic indexing selects the columns (cfr. the dictionaries of pure python)

Selecting a **single column**:

In [4]:
countries['area'] # single []

country
Belgium            30510
France            671308
Germany           357050
Netherlands        41526
United Kingdom    244820
Name: area, dtype: int64

or multiple **columns**:

In [5]:
countries[['area', 'population']] # double [[]]

                  area  population
country
Belgium          30510        11.3
France          671308        64.3
Germany         357050        81.3
Netherlands      41526        16.9
United Kingdom  244820        64.9

But, slicing or boolean indexing accesses the **rows**:

In [6]:
countries['France':'Netherlands']

               area    capital  population
country
France       671308      Paris        64.3
Germany      357050     Berlin        81.3
Netherlands   41526  Amsterdam        16.9

In [7]:
countries[countries['population'] > 50]

                  area capital  population
country
France          671308   Paris        64.3
Germany         357050  Berlin        81.3
United Kingdom  244820  London        64.9

<div class="alert alert-danger">
<b>NOTE</b>:

 <ul>
  <li>Unlike slicing in numpy, the end label is **included**!</li>
</ul>
</div>

<div class="alert alert-info" style="font-size:120%">
<b>REMEMBER</b>: <br><br>

So as a summary, `[]` provides the following convenience shortcuts:

<ul>
  <li>**Series**: selecting a **label**: `s[label]`</li>
  <li>**DataFrame**: selecting a single or multiple **columns**: `df['col']` or `df[['col1', 'col2']]`</li>
  <li>**DataFrame**: slicing or filtering the **rows**: `df['row_label1':'row_label2']` or `df[mask]`</li>
</ul>
</div>

## Systematic indexing with `loc` and `iloc`

When using `[]` like above, you can only select from one axis at once (rows or columns, not both). For more advanced indexing, you have some extra attributes:
    
* `loc`: selection by label
* `iloc`: selection by position

Both `loc` and `iloc` use the following pattern: `df.loc[ <selection of the rows> , <selection of the columns> ]`.

This 'selection of the rows / columns' can be: a single label, a list of labels, a slice or a boolean mask.

Selecting a single element:

In [8]:
countries.loc['Germany', 'area']

357050

But the row or column indexer can also be a list, slice, boolean array (see next section), ..

In [9]:
countries.loc['France':'Germany', ['area', 'population']]

           area  population
country
France   671308        64.3
Germany  357050        81.3

---
Selecting by position with `iloc` works similar as **indexing numpy arrays**:

In [10]:
countries.iloc[0:2,1:3]

          capital  population
country
Belgium  Brussels        11.3
France      Paris        64.3

The different indexing methods can also be used to **assign data**:

In [11]:
countries2 = countries.copy()
countries2.loc['Belgium':'Germany', 'population'] = 10

In [12]:
countries2

                  area    capital  population
country
Belgium          30510   Brussels        10.0
France          671308      Paris        10.0
Germany         357050     Berlin        10.0
Netherlands      41526  Amsterdam        16.9
United Kingdom  244820     London        64.9

<div class="alert alert-info" style="font-size:120%">
<b>REMEMBER</b>: <br><br>

Advanced indexing with **loc** and **iloc**

 <ul>
  <li>**loc**: select by label: `df.loc[row_indexer, column_indexer]`</li>
  <li>**iloc**: select by position: `df.iloc[row_indexer, column_indexer]`</li>
</ul>
</div>

## Boolean indexing (filtering)

Often, you want to select rows based on a certain condition. This can be done with 'boolean indexing' (like a where clause in SQL) and comparable to numpy. 

The indexer (or boolean mask) should be 1-dimensional and the same length as the thing being indexed.

In [13]:
countries['area'] > 100000

country
Belgium           False
France             True
Germany            True
Netherlands       False
United Kingdom     True
Name: area, dtype: bool

In [14]:
countries[countries['area'] > 100000]

                  area capital  population
country
France          671308   Paris        64.3
Germany         357050  Berlin        81.3
United Kingdom  244820  London        64.9

<div class="alert alert-success">
<b>EXERCISE</b>:

<p>
<ul>
    <li>Add the population density as column to the DataFrame.</li>
</ul>
</p>
Note: the population column is expressed in millions.
</div>

In [15]:
countries['density'] = countries['population']*1000000 / countries['area']

<div class="alert alert-success">
<b>EXERCISE</b>:

 <ul>
  <li>Select the capital and the population column of those countries where the density is larger than 300</li>
</ul>
</div>

In [16]:
countries.loc[countries['density'] > 300, ['capital', 'population']]

               capital  population
country
Belgium       Brussels        11.3
Netherlands  Amsterdam        16.9

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Add a column 'density_ratio' with the ratio of the population density to the average population density for all countries.</li>
</ul>
</div>

In [17]:
countries['density_ratio'] = countries['density'] / countries['density'].mean()
countries

                  area    capital  population     density  density_ratio
country
Belgium          30510   Brussels        11.3  370.370370       1.355755
France          671308      Paris        64.3   95.783158       0.350618
Germany         357050     Berlin        81.3  227.699202       0.833502
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820     London        64.9  265.092721       0.970382

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Change the capital of the UK to Cambridge</li>
</ul>
</div>

In [18]:
countries.loc['United Kingdom', 'capital'] = 'Cambridge'
countries

                  area    capital  population     density  density_ratio
country
Belgium          30510   Brussels        11.3  370.370370       1.355755
France          671308      Paris        64.3   95.783158       0.350618
Germany         357050     Berlin        81.3  227.699202       0.833502
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

<div class="alert alert-success">
<b>EXERCISE</b>:

 <ul>
  <li>Select all countries whose population density is between 100 and 300 people/km²</li>
</ul>
</div>

In [19]:
countries[(countries['density'] > 100) & (countries['density'] < 300)]

                  area    capital  population     density  density_ratio
country
Germany         357050     Berlin        81.3  227.699202       0.833502
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

# Some other essential methods: `isin` and `string` methods

The `isin` method of Series is very useful to select rows that may contain certain values:

In [20]:
s = countries['capital']

In [21]:
s.isin?

In [22]:
s.isin(['Berlin', 'London'])

country
Belgium           False
France            False
Germany            True
Netherlands       False
United Kingdom    False
Name: capital, dtype: bool

This can then be used to filter the dataframe with boolean indexing:

In [23]:
countries[countries['capital'].isin(['Berlin', 'London'])]

           area capital  population     density  density_ratio
country
Germany  357050  Berlin        81.3  227.699202       0.833502

Let's say we want to select all data for which the capital starts with a 'B'. In Python, when having a string, we could use the `startswith` method:

In [24]:
string = 'Berlin'

In [25]:
string.startswith('B')

True

In pandas, these are available on a Series through the `str` namespace:

In [26]:
countries['capital'].str.startswith('B')

country
Belgium            True
France            False
Germany            True
Netherlands       False
United Kingdom    False
Name: capital, dtype: bool

For an overview of all string methods, see: http://pandas.pydata.org/pandas-docs/stable/api.html#string-handling

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Select all countries that have capital names with more than 7 characters</li>
</ul>
    
</div>

In [27]:
countries[countries['capital'].str.len() > 7]

                  area    capital  population     density  density_ratio
country
Belgium          30510   Brussels        11.3  370.370370       1.355755
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Select all countries that have capital names that contain the character sequence 'am'</li>
</ul>
</div>

In [28]:
countries[countries['capital'].str.contains('am')]

                  area    capital  population     density  density_ratio
country
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

# Pitfall: chained indexing (and the 'SettingWithCopyWarning')

In [29]:
countries.loc['Belgium', 'capital'] = 'Ghent'

In [30]:
countries

                  area    capital  population     density  density_ratio
country
Belgium          30510      Ghent        11.3  370.370370       1.355755
France          671308      Paris        64.3   95.783158       0.350618
Germany         357050     Berlin        81.3  227.699202       0.833502
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

In [31]:
countries['capital']['Belgium'] = 'Antwerp'

/home/stijn_vanhoey/.pyenv/versions/miniconda3-4.3.11/envs/DS-python-data-analysis/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [32]:
countries

                  area    capital  population     density  density_ratio
country
Belgium          30510    Antwerp        11.3  370.370370       1.355755
France          671308      Paris        64.3   95.783158       0.350618
Germany         357050     Berlin        81.3  227.699202       0.833502
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

In [33]:
countries[countries['capital'] == 'Antwerp']['capital'] = 'Brussels'

/home/stijn_vanhoey/.pyenv/versions/miniconda3-4.3.11/envs/DS-python-data-analysis/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [34]:
countries

                  area    capital  population     density  density_ratio
country
Belgium          30510    Antwerp        11.3  370.370370       1.355755
France          671308      Paris        64.3   95.783158       0.350618
Germany         357050     Berlin        81.3  227.699202       0.833502
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

In [35]:
countries.loc[countries['capital'] == 'Antwerp', 'capital'] = 'Brussels' 
countries

                  area    capital  population     density  density_ratio
country
Belgium          30510   Brussels        11.3  370.370370       1.355755
France          671308      Paris        64.3   95.783158       0.350618
Germany         357050     Berlin        81.3  227.699202       0.833502
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

<div class="alert alert-info" style="font-size:120%">

<b>REMEMBER!</b><br><br>

What to do when encountering the *value is trying to be set on a copy of a slice from a DataFrame* error?

 <ul>
  <li>Use `loc` instead of chained indexing **if possible**!</li>
  <li>Or `copy` explicitly if you don't want to change the original data.</li>
</ul>

</div>

# Exercises using the Titanic dataset

In [36]:
df = pd.read_csv("../data/titanic.csv")

In [37]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Select all rows for male passengers and calculate the mean age of those passengers. Do the same for the female passengers.</li>
</ul>
</div>

In [38]:
males = df[df['Sex'] == 'male']

In [39]:
df.loc[df['Sex'] == 'male', 'Age'].mean()

30.726644591611478

In [40]:
df.loc[df['Sex'] == 'female', 'Age'].mean()

27.915708812260537

We will later see an easier way to calculate both averages at the same time with groupby.

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>How many passengers older than 70 were on the Titanic?</li>
</ul>
</div>

In [41]:
len(df[df['Age'] > 70])

5

In [42]:
(df['Age'] > 70).sum()

5

# [OPTIONAL] more exercises

For the quick ones among you, here are some more exercises with some larger dataframe with film data. These exercises are based on the [PyCon tutorial of Brandon Rhodes](https://github.com/brandon-rhodes/pycon-pandas-tutorial/) (so all credit to him!) and the datasets he prepared for that. You can download these data from here: [`titles.csv`](https://drive.google.com/open?id=0B3G70MlBnCgKajNMa1pfSzN6Q3M) and [`cast.csv`](https://drive.google.com/open?id=0B3G70MlBnCgKal9UYTJSR2ZhSW8) and put them in the `/data` folder.

In [43]:
cast = pd.read_csv('../data/cast.csv')
cast.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

In [44]:
titles = pd.read_csv('../data/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>How many movies are listed in the titles dataframe?</li>
</ul>
    
</div>

In [45]:
len(titles)

215981

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>What are the earliest two films listed in the titles dataframe?</li>
</ul>
</div>

In [46]:
titles.sort_values('year').head(2)

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>How many movies have the title "Hamlet"?</li>
</ul>
</div>

In [47]:
len(titles[titles['title'] == 'Hamlet'])

19

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>List all of the "Treasure Island" movies from earliest to most recent.</li>
</ul>
</div>

In [48]:
titles[titles.title == 'Treasure Island'].sort_values('year')

                  title  year
191379  Treasure Island  1918
47769   Treasure Island  1920
192917  Treasure Island  1934
90175   Treasure Island  1950
104714  Treasure Island  1972
103646  Treasure Island  1973
190792  Treasure Island  1985
166675  Treasure Island  1999

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>How many movies were made from 1950 through 1959?</li>
</ul>
</div>

In [49]:
len(titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)])

12120

In [50]:
len(titles[titles['year'] // 10 == 195])

12120

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>How many roles in the movie "Inception" are NOT ranked by an "n" value?</li>
</ul>
</div>

In [51]:
inception = cast[cast['title'] == 'Inception']

In [52]:
len(inception[inception['n'].isnull()])

22

In [53]:
inception['n'].isnull().sum()

22

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>But how many roles in the movie "Inception" did receive an "n" value?</li>
</ul>
</div>

In [54]:
len(inception[inception['n'].notnull()])

51

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>Display the cast of the "Titanic" (the most famous 1997 one) in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.</li>
</ul>
</div>

In [55]:
titanic = cast[(cast['title'] == 'Titanic') & (cast['year'] == 1997)]
titanic = titanic[titanic['n'].notnull()]
titanic.sort_values('n')

,title,year,name,type,character,n
527123,Titanic,1997,Leonardo DiCaprio,actor,Jack Dawson,1.0
3304287,Titanic,1997,Kate Winslet,actress,Rose DeWitt Bukater,2.0
2241466,Titanic,1997,Billy Zane,actor,Caledon 'Cal' Hockley,3.0
2323120,Titanic,1997,Kathy Bates,actress,Molly Brown,4.0
2567572,Titanic,1997,Frances Fisher,actress,Ruth Dewitt Bukater,5.0
3191641,Titanic,1997,Gloria Stuart,actress,Old Rose,6.0
1574043,Titanic,1997,Bill Paxton,actor,Brock Lovett,7.0
892362,Titanic,1997,Bernard Hill,actor,Captain Edward James Smith,8.0
2140296,Titanic,1997,David Warner,actor,Spicer Lovejoy,9.0
711245,Titanic,1997,Victor Garber,actor,Thomas Andrews,10.0
944114,Titanic,1997,Jonathan Hyde,actor,Bruce Ismay,11.0
2278625,Titanic,1997,Suzy Amis,actress,Lizzy Calvert,12.0
3766,Titanic,1997,Lewis Abernathy,actor,Lewis Bodine,13.0
322588,Titanic,1997,Nicholas Cascone,actor,Bobby Buell,14.0
1779789,Titanic,1997,Anatoly M. Sagalevitch,actor,Anatoly Milkailavich,15.0
1498206,Titanic,1997,Danny Nucci,actor,Fabrizio,16.0
127041,Titanic,1997,Jason Barry,actor,Tommy Ryan,17.0
1947153,Titanic,1997,Ewan Stewart,actor,1st Officer Murdoch,18.0
797473,Titanic,1997,Ioan Gruffudd,actor,Fifth Officer Lowe,19.0
1602639,Titanic,1997,Jonny Phillips,actor,2nd Officer Lightoller,20.0
348215,Titanic,1997,Mark Lindsay Chapman,actor,Chief Officer Wilde,21.0
776453,Titanic,1997,Richard Graham,actor,Quartermaster Rowe,22.0
242344,Titanic,1997,Paul Brightwell,actor,Quartermaster Hichens,23.0
543256,Titanic,1997,Ron Donachie,actor,Master at Arms,24.0
228784,Titanic,1997,Eric Braeden,actor,John Jacob Astor,25.0
2424786,Titanic,1997,Charlotte Chatton,actress,Madeleine Astor,26.0
676089,Titanic,1997,Bernard Fox,actor,Col. Archibald Gracie,27.0
604549,Titanic,1997,Michael Ensign,actor,Benjamin Guggenheim,28.0
2372948,Titanic,1997,Fannie Brett,actress,Madame Aubert,29.0
2617608,Titanic,1997,Jenette Goldstein,actress,Irish Mommy,30.0
...,...,...,...,...,...,...
2977386,Titanic,1997,Tricia O'Neil,actress,Woman,83.0
2527642,Titanic,1997,Kathleen S. Dunn,actress,Woman in Water,84.0
679518,Titanic,1997,Romeo Francis,actor,Syrian Man,85.0
2869638,Titanic,1997,Mandana Marino,actress,Syrian Woman,86.0
1197916,Titanic,1997,Van Ling,actor,Chinese Man,87.0
1523657,Titanic,1997,Bj?rn Olsen,actor,Olaf,88.0
1597455,Titanic,1997,Dan Pettersson,actor,Sven,89.0
562971,Titanic,1997,Shay Duffin,actor,Pubkeeper,90.0
597613,Titanic,1997,Greg (II) Ellis,actor,Carpathia Steward,91.0
2934870,Titanic,1997,Diana (II) Morgan,actress,News Reporter,92.0
855459,Titanic,1997,Lorenz Hasler,actor,Orchestra Member,93.0
699212,Titanic,1997,Thomas F?ri,actor,Orchestra Member,94.0
1981068,Titanic,1997,Ferenc Szedl?k,actor,Orchestra Member,95.0
1981067,Titanic,1997,B?la Szedl?k,actor,Orchestra Member,96.0
739499,Titanic,1997,Werner Giger,actor,Orchestra Member,97.0
1444630,Titanic,1997,Patrick (IV) Murphy,actor,Steerage Band Member,98.0
2153777,Titanic,1997,Stephen Wehmeyer,actor,Steerage Band Member,99.0
2062558,Titanic,1997,Stephen Twigger,actor,Steerage Band Member,100.0
1215345,Titanic,1997,Shep Lonsdale,actor,Steerage Band Member,101.0
2700542,Titanic,1997,Samantha (III) Hunt,actress,Steerage Band Member,102.0
51528,Titanic,1997,Kris Andersson,actor,Dancer,108.0
2322890,Titanic,1997,Bobbie Bates,actress,Dancer,109.0
323290,Titanic,1997,Aaron James Cash,actor,Dancer,110.0
2570091,Titanic,1997,Anne Fletcher,actress,Dancer,111.0
671391,Titanic,1997,Edmond Alan Forsyth,actor,Dancer,112.0
2678999,Titanic,1997,Andie Hicks,actress,Dancer,113.0
898633,Titanic,1997,Scott Hislop,actor,Dancer,114.0
1315604,Titanic,1997,Stan Mazin,actor,Dancer,115.0
3054629,Titanic,1997,Lisa Ratzin,actress,Dancer,116.0
3062849,Titanic,1997,Julene Renee,actress,Dancer,117.0

<div class="alert alert-success">

<b>EXERCISE</b>:

 <ul>
  <li>List the supporting roles (having n=2) played by Brad Pitt in the 1990s, in order by year.</li>
</ul>
</div>

In [56]:
brad = cast[cast['name'] == 'Brad Pitt']
brad = brad[brad['year'] // 10 == 199]
brad = brad[brad['n'] == 2]
brad.sort_values('year')

,title,year,name,type,character,n
1614615,Across the Tracks,1990,Brad Pitt,actor,Joe Maloney,2.0
1614613,A River Runs Through It,1992,Brad Pitt,actor,Paul Maclean,2.0
1614657,The Devil's Own,1997,Brad Pitt,actor,Rory Devaney,2.0
1614658,The Devil's Own,1997,Brad Pitt,actor,Francis Austin McGuire,2.0
1614623,Fight Club,1999,Brad Pitt,actor,Tyler Durden,2.0

# Acknowledgement


> The optional exercises are based on the [PyCon tutorial of Brandon Rhodes](https://github.com/brandon-rhodes/pycon-pandas-tutorial/) (so all credit to him!) and the datasets he prepared for that.

---